backend/app/controllers/api/puzzle_controller.rb

SELECT "puzzles".* FROM "puzzles" WHERE "puzzles"."date" = $1 LIMIT $2  [["date", "2026-03-26"], ["LIMIT", 1]]
---
    def today
      puzzle = Puzzle.for_date!(Date.current)

      render json: {
        date: puzzle.date.to_s,
        puzzle: {
          vertical: puzzle.vertical,
          horizontal: puzzle.horizontal,
          order: puzzle.order