backend/app/controllers/api/wordle_controller.rb

    def today
      word = today_word
      return unless word

      render json: {id: word.id, length: word.word.length, date: word.date.to_s}
---
SELECT "words".* FROM "words" WHERE "words"."date" = $1 LIMIT $2  [["date", "2026-03-19"], ["LIMIT", 1]]